Revit 2024 API
ItemFactoryBase.NewDetailCurve Method
 Creates a new detail curve element.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public DetailCurve NewDetailCurve(
	View view,
	Curve geometryCurve
)
Visual Basic
Public Function NewDetailCurve ( _
	view As View, _
	geometryCurve As Curve _
) As DetailCurve
Visual C++
public:
DetailCurve^ NewDetailCurve(
	View^ view,
	Curve^ geometryCurve
)
Parameters
view
Type: Autodesk.Revit.DB.View
 The view in which the detail curve is to be visible.
geometryCurve
Type: Autodesk.Revit.DB.Curve
 The internal geometry curve for detail curve. It should be a bound curve.
Return Value
 If successful a new detail curve element. Otherwise null.
Remarks
 Different type of detail curve element will be returned according to the type of geometry curve.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException | Thrown when curve is not in plane of the view
See Also
ItemFactoryBase Class
Autodesk.Revit.Creation Namespace